Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0128GPM036.PIC
      <edc:SFRDef edc:_addr="0x1F802CF0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="ODCB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="ODCB" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB2" edc:desc="" edc:mask="0x1" edc:name="ODCB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB3" edc:desc="" edc:mask="0x1" edc:name="ODCB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB5" edc:desc="" edc:mask="0x1" edc:name="ODCB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB6" edc:desc="" edc:mask="0x1" edc:name="ODCB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB10" edc:desc="" edc:mask="0x1" edc:name="ODCB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB11" edc:desc="" edc:mask="0x1" edc:name="ODCB11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB15" edc:desc="" edc:mask="0x1" edc:name="ODCB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D00" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNPUB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="CNPUB" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUB0" edc:desc="" edc:mask="0x1" edc:name="CNPUB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB1" edc:desc="" edc:mask="0x1" edc:name="CNPUB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB2" edc:desc="" edc:mask="0x1" edc:name="CNPUB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB3" edc:desc="" edc:mask="0x1" edc:name="CNPUB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB4" edc:desc="" edc:mask="0x1" edc:name="CNPUB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB5" edc:desc="" edc:mask="0x1" edc:name="CNPUB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB6" edc:desc="" edc:mask="0x1" edc:name="CNPUB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB7" edc:desc="" edc:mask="0x1" edc:name="CNPUB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB8" edc:desc="" edc:mask="0x1" edc:name="CNPUB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB9" edc:desc="" edc:mask="0x1" edc:name="CNPUB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB10" edc:desc="" edc:mask="0x1" edc:name="CNPUB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB11" edc:desc="" edc:mask="0x1" edc:name="CNPUB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUB13" edc:desc="" edc:mask="0x1" edc:name="CNPUB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB14" edc:desc="" edc:mask="0x1" edc:name="CNPUB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB15" edc:desc="" edc:mask="0x1" edc:name="CNPUB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D10" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNPDB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="CNPDB" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDB0" edc:desc="" edc:mask="0x1" edc:name="CNPDB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB1" edc:desc="" edc:mask="0x1" edc:name="CNPDB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB2" edc:desc="" edc:mask="0x1" edc:name="CNPDB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB3" edc:desc="" edc:mask="0x1" edc:name="CNPDB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB4" edc:desc="" edc:mask="0x1" edc:name="CNPDB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB5" edc:desc="" edc:mask="0x1" edc:name="CNPDB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB6" edc:desc="" edc:mask="0x1" edc:name="CNPDB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB7" edc:desc="" edc:mask="0x1" edc:name="CNPDB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB8" edc:desc="" edc:mask="0x1" edc:name="CNPDB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB9" edc:desc="" edc:mask="0x1" edc:name="CNPDB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB10" edc:desc="" edc:mask="0x1" edc:name="CNPDB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB11" edc:desc="" edc:mask="0x1" edc:name="CNPDB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDB13" edc:desc="" edc:mask="0x1" edc:name="CNPDB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB14" edc:desc="" edc:mask="0x1" edc:name="CNPDB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB15" edc:desc="" edc:mask="0x1" edc:name="CNPDB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D20" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nn--nn----------" edc:cname="CNCONB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00--00----------" edc:name="CNCONB" edc:nzwidth="0x20" edc:por="----------------00--00----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="PORT32" edc:desc="" edc:mask="0x1" edc:name="PORT32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNSTYLE" edc:desc="" edc:mask="0x1" edc:name="CNSTYLE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D30" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNEN0B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0efff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="CNEN0B" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0B0" edc:desc="" edc:mask="0x1" edc:name="CNIE0B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B1" edc:desc="" edc:mask="0x1" edc:name="CNIE0B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B2" edc:desc="" edc:mask="0x1" edc:name="CNIE0B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B3" edc:desc="" edc:mask="0x1" edc:name="CNIE0B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B4" edc:desc="" edc:mask="0x1" edc:name="CNIE0B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B5" edc:desc="" edc:mask="0x1" edc:name="CNIE0B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B6" edc:desc="" edc:mask="0x1" edc:name="CNIE0B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B7" edc:desc="" edc:mask="0x1" edc:name="CNIE0B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B8" edc:desc="" edc:mask="0x1" edc:name="CNIE0B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B9" edc:desc="" edc:mask="0x1" edc:name="CNIE0B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B10" edc:desc="" edc:mask="0x1" edc:name="CNIE0B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B11" edc:desc="" edc:mask="0x1" edc:name="CNIE0B11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B13" edc:desc="" edc:mask="0x1" edc:name="CNIE0B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B14" edc:desc="" edc:mask="0x1" edc:name="CNIE0B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0B15" edc:desc="" edc:mask="0x1" edc:name="CNIE0B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D40" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxx-xxxxxxxxxxxx" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="----------------xxx-xxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB15" edc:desc="" edc:mask="0x1" edc:name="CNSTATB15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D50" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNEN1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0efff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="CNEN1B" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1B0" edc:desc="" edc:mask="0x1" edc:name="CNIE1B0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B1" edc:desc="" edc:mask="0x1" edc:name="CNIE1B1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B2" edc:desc="" edc:mask="0x1" edc:name="CNIE1B2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B3" edc:desc="" edc:mask="0x1" edc:name="CNIE1B3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B4" edc:desc="" edc:mask="0x1" edc:name="CNIE1B4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B5" edc:desc="" edc:mask="0x1" edc:name="CNIE1B5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B6" edc:desc="" edc:mask="0x1" edc:name="CNIE1B6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B7" edc:desc="" edc:mask="0x1" edc:name="CNIE1B7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B8" edc:desc="" edc:mask="0x1" edc:name="CNIE1B8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B9" edc:desc="" edc:mask="0x1" edc:name="CNIE1B9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B10" edc:desc="" edc:mask="0x1" edc:name="CNIE1B10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B11" edc:desc="" edc:mask="0x1" edc:name="CNIE1B11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B13" edc:desc="" edc:mask="0x1" edc:name="CNIE1B13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B14" edc:desc="" edc:mask="0x1" edc:name="CNIE1B14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1B15" edc:desc="" edc:mask="0x1" edc:name="CNIE1B15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D60" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnn-nnnnnnnnnnnn" edc:cname="CNFB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc0efff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-000000000000" edc:name="CNFB" edc:nzwidth="0x20" edc:por="----------------000-000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:desc="" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:desc="" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:desc="" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB3" edc:desc="" edc:mask="0x1" edc:name="CNFB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:desc="" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB5" edc:desc="" edc:mask="0x1" edc:name="CNFB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB6" edc:desc="" edc:mask="0x1" edc:name="CNFB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:desc="" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:desc="" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:desc="" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB10" edc:desc="" edc:mask="0x1" edc:name="CNFB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB11" edc:desc="" edc:mask="0x1" edc:name="CNFB11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:desc="" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:desc="" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB15" edc:desc="" edc:mask="0x1" edc:name="CNFB15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D70" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="--------------------------------" edc:cname="SR0B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc00000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="SR0B" edc:nzwidth="0x20" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802D80" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="--------------------------------" edc:cname="SR1B" edc:desc="" edc:grp="PORTB" edc:impl="0xffc00000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="SR1B" edc:nzwidth="0x20" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
