Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0128GPM036.PIC
      <edc:SFRDef edc:_addr="0x1F80F0D0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--n---nn----nnn-----nnnnnnnnnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xF3FE3FFF" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--000000000---00000000000000" edc:name="IEC1" edc:nzwidth="32" edc:por="0000--000000000---00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:desc="" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1IE" edc:desc="" edc:mask="0x1" edc:name="AD1IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LVDIE" edc:mask="0x1" edc:name="LVDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLC1IE" edc:desc="" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC2IE" edc:desc="" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC3IE" edc:desc="" edc:mask="0x1" edc:name="CLC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC4IE" edc:desc="" edc:mask="0x1" edc:name="CLC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:desc="" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2RXIE" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2TXIE" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2EIE" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIE" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3EIE" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F0E0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nn-nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0xdfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u-00000000000000000000000000000" edc:name="IEC2" edc:nzwidth="32" edc:por="0x-00000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1BCIE" edc:mask="0x1" edc:name="I2C1BCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIE" edc:mask="0x1" edc:name="I2C2SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIE" edc:mask="0x1" edc:name="I2C2MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIE" edc:mask="0x1" edc:name="I2C2BCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIE" edc:mask="0x1" edc:name="I2C3SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIE" edc:mask="0x1" edc:name="I2C3MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3BCIE" edc:mask="0x1" edc:name="I2C3BCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT1IE" edc:mask="0x1" edc:name="CCT1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP2IE" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT2IE" edc:mask="0x1" edc:name="CCT2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP3IE" edc:mask="0x1" edc:name="CCP3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT3IE" edc:mask="0x1" edc:name="CCT3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP4IE" edc:mask="0x1" edc:name="CCP4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT4IE" edc:mask="0x1" edc:name="CCT4IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP5IE" edc:mask="0x1" edc:name="CCP5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT5IE" edc:mask="0x1" edc:name="CCT5IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP6IE" edc:mask="0x1" edc:name="CCP6IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT6IE" edc:mask="0x1" edc:name="CCT6IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP7IE" edc:mask="0x1" edc:name="CCP7IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT7IE" edc:mask="0x1" edc:name="CCT7IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP8IE" edc:mask="0x1" edc:name="CCP8IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT8IE" edc:mask="0x1" edc:name="CCT8IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP9IE" edc:mask="0x1" edc:name="CCP9IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT9IE" edc:mask="0x1" edc:name="CCT9IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTIE" edc:mask="0x1" edc:name="FSTIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="NVMIE" edc:mask="0x1" edc:name="NVMIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCIE" edc:mask="0x1" edc:name="CPCIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
