Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0128GPM036.PIC
      <edc:SFRDef edc:_addr="0x1FC41850" edc:_begin="0x0" edc:_end="0x14" edc:_modsrc="DOS-02610_SABE_UDID.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="UDID5" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="false" edc:mclr="--------------------------------" edc:name="UDID5" edc:nzwidth="32" edc:por="--------------------------------">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:desc="PIC32MM0064 (36-pin QFN)" edc:ppsflavor="complex">
    <edc:Pin>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="RP8"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="OCM2E"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="RP9"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="OCM2F"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="T2CK"/>
      <edc:VirtualPin edc:name="T2G"/>
      <edc:VirtualPin edc:name="RC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="T3CK"/>
      <edc:VirtualPin edc:name="T3G"/>
      <edc:VirtualPin edc:name="RC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RP19"/>
      <edc:VirtualPin edc:name="OCM2A"/>
      <edc:VirtualPin edc:name="RC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="RP3"/>
      <edc:VirtualPin edc:name="OCM1C"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="RP4"/>
      <edc:VirtualPin edc:name="OCM1D"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RP10"/>
      <edc:VirtualPin edc:name="OCM3C"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="SCLKI"/>
      <edc:VirtualPin edc:name="RP5"/>
      <edc:VirtualPin edc:name="PWRLCLK"/>
      <edc:VirtualPin edc:name="OCM3D"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RP24"/>
      <edc:VirtualPin edc:name="OCM3A"/>
      <edc:VirtualPin edc:name="RA9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="RP11"/>
      <edc:VirtualPin edc:name="ASDA1"/>
      <edc:VirtualPin edc:name="USBID"/>
      <edc:VirtualPin edc:name="SS3"/>
      <edc:VirtualPin edc:name="FSYNC3"/>
      <edc:VirtualPin edc:name="OCM3E"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBUS"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RP12"/>
      <edc:VirtualPin edc:name="SDA3"/>
      <edc:VirtualPin edc:name="SDI3"/>
      <edc:VirtualPin edc:name="OCM3F"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="RP13"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="U1CTS"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="OCM1A"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="REFCLKI"/>
      <edc:VirtualPin edc:name="RP14"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="T1G"/>
      <edc:VirtualPin edc:name="U1RTS"/>
      <edc:VirtualPin edc:name="U1BCLK"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="OCM1B"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="RC8"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="RP18"/>
      <edc:VirtualPin edc:name="ASCL1"/>
      <edc:VirtualPin edc:name="USBOEN"/>
      <edc:VirtualPin edc:name="SDO3"/>
      <edc:VirtualPin edc:name="RC9"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D-"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="D+"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="RP15"/>
      <edc:VirtualPin edc:name="SCL3"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="RP16"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="VBUSON"/>
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="OCM3B"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="REFCLKO"/>
      <edc:VirtualPin edc:name="RP17"/>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="FSYNC1"/>
      <edc:VirtualPin edc:name="OCM2B"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVSS"/>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="RP1"/>
      <edc:VirtualPin edc:name="OCM1E"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="RP2"/>
      <edc:VirtualPin edc:name="OCM1F"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="RP6"/>
      <edc:VirtualPin edc:name="OCM2C"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="RP7"/>
      <edc:VirtualPin edc:name="OCM2D"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFB"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="TCKIA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="TCKIB"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="ICM9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="CLCINA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="CLCINB"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK2OUT" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2OUT" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM5" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM6" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM7" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM8" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OCM9" edc:ppsval="16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CLC1OUT" edc:ppsval="17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CLC2OUT" edc:ppsval="18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CLC3OUT" edc:ppsval="19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="CLC4OUT" edc:ppsval="20"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
